Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: སྲོག་ལ་ཡིད་མི་རྟོན་པ་སྔོན་དུ་འགྲོ་བ་དང་། མོས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་སྔོན་དུ་འགྲོ་བ་དང་། བྱམས་པའི་སྟོབས་སྔོན་དུ་འགྲོ་བ་དང་། ཟབ་མོའི་ཆོས་ལ་བཟོད་པ་སྔོན་དུ་འགྲོ་བ་དང་།
en: They are (1) the preliminary of forsaking desire; (2) the preliminary of forsaking anger; (3) the preliminary of having no concern for one’s body; (4) the preliminary of not being concerned with one’s life; (5) the preliminary of aspiration; (6) the preliminary of ripening beings; (7) the preliminary of the strength of love; (8) the preliminary of patience for profound Dharma; (9) the preliminary of aspiration for that which is vast; and (10) the preliminary of dispelling ignorance.

source: རྒྱ་ཆེན་པོ་ལ་མོས་པ་སྔོན་དུ་འགྲོ་བ་དང་། མི་ཤེས་པ་བསལ་བ་སྔོན་དུ་འགྲོ་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུའོ། །
en: “Noble one, those are the ten qualities that are the preliminaries for the perfection of patience of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུ་སྟེ།
en: “Noble one, there are ten qualities that are preliminaries to the perfection of diligence of a bodhisattva.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བྱ་བ་ཅི་ཡོད་སྙམ་པ་སྔོན་དུ་འགྲོ་བ་དང་། དགེ་བའི་ལུས་དང་། ངག་དང་ཡིད་མངོན་པར་བསྒྲུབ་པ་ལ་རྗེས་སུ་ཡི་རང་བ་སྔོན་དུ་འགྲོ་བ་དང་། ཞུམ་པ་མེད་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བསྡུ་བ་ཐོབ་པར་བྱ་བ་སྔོན་དུ་འགྲོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་སྔོན་དུ་འགྲོ་བ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཉོན་མོངས་པའི་དགྲ་འདུལ་བ་སྔོན་དུ་འགྲོ་བ་དང་།
en: They are (1) the preliminary that is thinking of what is to be done for all beings; (2) the preliminary that is rejoicing in the accomplishment of a virtuous body, speech, and mind; (3) the preliminary that is never being disheartened; (4) the preliminary that is the activity of attaining the level of irreversibility; (5) the preliminary that is correct effort; (6) the preliminary that is mindfulness; (7) the preliminary that is subjugating the enemy, which is the kleśas; (8) the preliminary that is being detached from all phenomena; (9) the preliminary that is the activity of ripening beings; and (10) the preliminary that is the accomplishment of omniscient knowledge.

source: ཆོས་ཐམས་ཅད་ཀྱིས་དབེན་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་སྔོན་དུ་འགྲོ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡང་དག་པར་སྒྲུབ་པ་སྔོན་དུ་འགྲོ་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུའོ། །
en: “Noble one, those are the ten qualities that are the preliminaries for the perfection of diligence of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུ་སྟེ།
en: “Noble one, there are ten qualities that are preliminaries to the perfection of meditation of a bodhisattva.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དགེ་བའི་ཆོས་ལ་གནས་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཏིང་ངེ་འཛིན་སྔོན་དུ་འགྲོ་བ་དང་། སྙོམས་པར་འཇུག་པ་སྔོན་དུ་འགྲོ་བ་དང་།
en: What are the ten?

source: ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྔོན་དུ་འགྲོ་བ་དང་། བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་སྔོན་དུ་འགྲོ་བ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤོང་བ་སྔོན་དུ་འགྲོ་བ་དང་།
en: They are (1) the preliminary that is maintaining good qualities; (2) the preliminary that is samādhi; (3) the preliminary that is samāpatti; (4) the preliminary that is complete enlightenment; (5) the preliminary that is dhyāna and liberations; (6) the preliminary that is the faculty of samādhi; (7) the preliminary that is the strength of samādhi; (8) the preliminary that is forsaking the kleśas of all beings; (9) the preliminary that is completing the aggregation of samādhis; and (10) the preliminary that is guarding the Dharma.

source: ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་སྔོན་དུ་འགྲོ་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བ་སྔོན་དུ་འགྲོ་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུའོ། །
en: “Noble one, those are the ten qualities that are the preliminaries for the perfection of meditation of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་འདི་བཅུ་སྟེ།
en: “Noble one, there are ten qualities that are preliminaries to the perfection of wisdom of a bodhisattva.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕུང་པོ་ལ་མཁས་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཁམས་ལ་མཁས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པ་སྔོན་དུ་འགྲོ་བ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མཁས་པ་སྔོན་དུ་འགྲོ་བ་དང་།
en: What are the ten?

source: བདེན་པ་ལ་མཁས་པ་སྔོན་དུ་འགྲོ་བ་དང་། ལྟ་བར་གྱུར་པ་ཐམས་ཅད་བསལ་བ་སྔོན་དུ་འགྲོ་བ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྔོན་དུ་འགྲོ་བ་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྔོན་དུ་འགྲོ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་སྔོན་དུ་འགྲོ་བ་དང་།
en: They are (1) the preliminary that is being skilled in the skandhas; (2) the preliminary that is being skilled in the dhātus; (3) the preliminary that is being skilled in the āyatanas; (4) the preliminary that is being skilled in dependent origination; (5) the preliminary that is being skilled in the truths; (6) the preliminary that is dispelling all wrong views; (7) the preliminary that is the faculty of wisdom; (8) the preliminary that is patience toward the quality of birthlessness; (9) the preliminary that is completing all the qualities of buddhahood; and (10) the preliminary that is seeing unobscured wisdom.

source: སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་སྔོན་དུ་འགྲོ་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུའོ། །
en: “Noble one, those are the ten qualities that are the preliminaries for the perfection of wisdom of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་ལ་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུ་སྟེ།
en: “Noble one, there are ten qualities that are preliminaries to the perfection of the skill in methods of a bodhisattva.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་གྱི་བསམ་པ་དང་སྤྱོད་པ་ལ་འཇུག་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་གྱི་རྟེན་སྔོན་དུ་འགྲོ་བ་དང་།
en: What are the ten?

source: བྱམས་པ་དང་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མི་སྐྱོ་བ་སྔོན་དུ་འགྲོ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་འཇུག་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཁྱད་པར་ཅན་གྱི་ཡེ་ཤེས་མཐོང་བ་ཁོང་དུ་ཆུད་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བྱང་བར་བྱ་བ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་སྔོན་དུ་འགྲོ་བ་དང་། དངོས་པོ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་རྟོག་པ་སྔོན་དུ་འགྲོ་བ་དང་།
en: They are (1) the preliminary that is engaging with the motivations and conduct of beings; (2) the preliminary that is becoming a support for beings; (3) the preliminary that is great love and compassion; (4) the preliminary that is the ripening of beings; (5) the preliminary that is engagement in all the qualities of buddhahood; (6) the preliminary that is seeing special wisdom; (7) the preliminary that is the purification of the perfections; (8) the preliminary that is the contemplation of things exactly as they are; (9) the preliminary that is the accomplishment of the strength of the mind; and (10) the preliminary that is the attainment of the level of irreversibility.

source: སེམས་ཀྱི་སྟོབས་ཉེ་བར་བསྒྲུབ་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཕྱིར་མི་ལྡོག་པའི་ས་ཡོངས་སུ་ཐོབ་པར་བྱེད་པ་སྔོན་དུ་འགྲོ་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུའོ། །
en: “Noble one, those are the ten qualities that are the preliminaries for the perfection of skill in methods of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུ་སྟེ།
en: “Noble one, there are ten qualities that are preliminaries to the perfection of prayer of a bodhisattva.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་མོས་པ་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། ལྷག་པའི་བསམ་པ་དང་། མོས་པ་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐ་དད་པ་དང་། ཁམས་གསུམ་གྱི་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་གྱི་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཆི་འཕོ་དང་། སྐྱེ་བ་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕུང་པོ་གསུམ་དུ་རྣམ་པར་གཞག་པ་ཐིབས་པོ་ཉེ་བར་རྒྱུ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་།
en: They are (1) the preliminary that is the knowledge of the movements of the massed mental conduct of all beings; (2) the preliminary that is the knowledge of the movements of the massed kleśas of all beings; (3) the preliminary that is the knowledge of the movements of the massed faculties of all beings; (4) the preliminary that is the knowledge of the movements of the massed motivations and aspirations of all beings; (5) the preliminary that is the knowledge of the movements of the massed motivations, higher motivations, and aspirations of all beings; (6) the preliminary that is the knowledge of the movements in the separate world realms and the three realms; (7) the preliminary that is the knowledge of the movements of the massed motivations and propensities of all beings; (8) the preliminary that is the knowledge of the movements of the massed deaths and rebirths of all beings; (9) the preliminary that is the knowledge of the movements of the display of the three aggregations of all beings; and (10) the preliminary that is the knowledge of ripening beings who have untiring faculties.

source: དབང་པོ་མི་སྐྱོ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུའོ། །
en: “Noble one, those are the ten qualities that are the preliminaries for the perfection of prayer of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུ་སྟེ།
en: “Noble one, there are ten qualities that are preliminaries to the perfection of strength of a bodhisattva.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་འབྱུང་བ་མེད་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་མཚན་ཉིད་མེད་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་སྐྱེ་བ་མེད་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་ཡོད་པ་མ་ཡིན་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཆོས་ཐམས་ཅད་གཟོད་མ་ནས་ཆགས་པ་མེད་པ་སྔོན་དུ་འགྲོ་བ་དང་།
en: What are the ten?

source: ཆོས་ཐམས་ཅད་འཇུག་པ་མེད་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཆོས་ཐམས་ཅད་ལྡོག་པ་མེད་པ་སྔོན་དུ་འགྲོ་བ་དང་། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྔོན་དུ་འགྲོ་བ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཐོག་མ་དང་བར་མ་དང་ཐ་མ་མཉམ་པ་ཉིད་སྔོན་དུ་འགྲོ་བ་དང་། ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་ལ་འཇུག་པའི་རྟོག་པ་དང་།
en: They are (1) the preliminary that is the primordial nonorigination of all phenomena; (2) the preliminary that is the primordial nonexistence of the characteristics of all phenomena; (3) the preliminary that is the knowledge of the primordial birthlessness of all phenomena; (4) the preliminary that is the knowledge of the primordial nonexistence of all phenomena; (5) the preliminary that is the knowledge of the primordial nonformation of all phenomena; (6) the preliminary that is the knowledge that all phenomena do not enter; (7) the preliminary that is the knowledge that all phenomena do not turn back; (8) the preliminary that is the knowledge that all phenomena have the nature of nothingness; (9) the preliminary that is the knowledge that the beginning, middle, and end of all phenomena are the same; and (10) the preliminary that is the absence of concepts or thoughts engaging with the true nature of all phenomena.

source: རྣམ་པར་རྟོག་པ་མེད་པ་སྔོན་དུ་འགྲོ་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུའོ། །
en: “Noble one, those are the ten qualities that are the preliminaries for the perfection of strength of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུ་སྟེ།
en: “Noble one, there are ten qualities that are preliminaries to the perfection of knowledge of a bodhisattva.

source: ཆོས་ཐམས་ཅད་རྣམ་པར་དབྱེ་བ་ལ་ཤིན་ཏུ་རྣམ་པར་བརྟགས་པ་སྔོན་དུ་འགྲོ་བ་དང་། དཀར་པོའི་ཆོས་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པ་སྔོན་དུ་འགྲོ་བ་དང་། བྱང་ཆུབ་ཀྱི་ཚོགས་བསགས་པ་དཔག་ཏུ་མེད་པ་སྔོན་དུ་འགྲོ་བ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོ་ཡོངས་སུ་བཟུང་བ་སྔོན་དུ་འགྲོ་བ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡངས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་སྔོན་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དབྱེ་བའི་རིམ་པ་ཤེས་པ་སྔོན་དུ་འགྲོ་བ་དང་། སེམས་ཅན་གྱི་ཁམས་དང་། ཉོན་མོངས་པའི་སྤྱོད་པ་ལ་འཇུག་པ་སྔོན་དུ་འགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ལ་འཇུག་ཅིང་རྗེས་སུ་འགྲོ་བ་ཤེས་པ་ཡིད་ལ་བྱེད་པ་སྔོན་དུ་འགྲོ་བ་དང་།
en: They are (1) the preliminary that is the analysis that differentiates all phenomena; (2) the preliminary that is the completion of all good qualities; (3) the preliminary that is an immeasurable gathering of the accumulation of enlightenment; (4) the preliminary that is possessing a vast accumulation of merit and wisdom; (5) the preliminary that is the realization of vast great compassion; (6) the preliminary that is the knowledge that all phenomena do not enter; (7) the preliminary that is the knowledge of the levels of categories of the world realms; (8) the preliminary that is comprehending the realms of beings and the conduct motivated by the kleśas; (9) the preliminary that is the mental activity of comprehending and following the range of activity of the tathāgatas; and (10) the preliminary that is the higher perception and complete knowledge of the ten strengths, the fearlessnesses, and the unique qualities of a buddha.

source: སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་ལྷག་པར་དམིགས་ཤིང་ཀུན་ཤེས་པར་བྱ་བ་སྔོན་དུ་འགྲོ་བ་དང་། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་དབང་བསྐུར་བའི་ས་ཐོབ་པ་སྔོན་དུ་འགྲོ་བ་སྟེ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་སྔོན་དུ་འགྲོ་བའི་ཆོས་རྣམ་པ་བཅུའོ། །
en: “Noble one, those are the ten qualities that are the preliminaries for the perfection of knowledge of the bodhisattvas.

source: དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་གང་ཞེ་ན།
en: “Noble one, what is the meaning of perfection?

source: སྤྱོད་པའི་ཁྱད་པར་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of special conduct: that is the meaning of perfection.

source: ཡེ་ཤེས་ཟབ་ཅིང་རྒྱ་ཆེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of vast and profound wisdom: that is the meaning of perfection.

source: འདུས་བྱས་དང་འདུས་མ་བྱས་ལ་ཆགས་པ་མེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The absence of attachment to the composite and noncomposite: that is the meaning of perfection.

source: འཁོར་བའི་ཉེས་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The correct realization of the faults of saṃsāra: that is the meaning of perfection.

source: སྐྱེ་བོ་མི་མཁས་པ་རྣམས་ཁོང་དུ་ཆུད་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Comprehending unwise beings: that is the meaning of perfection.

source: ཆོས་ཀྱི་མཛོད་ཟད་མི་ཤེས་པ་ཡང་དག་པར་སྟོན་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Teaching the treasure of the Dharma that knows no cessation: that is the meaning of perfection.

source: སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of unobscured liberation: that is the meaning of perfection.

source: སེམས་ཅན་གྱི་ཁམས་རབ་ཏུ་ཤེས་པར་བྱ་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Knowing the realms of beings: that is the meaning of perfection.

source: སྦྱིན་པ་མཉམ་པ་ཉིད་རྗེས་སུ་རྟོགས་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The realization of the sameness of generosity: that is the meaning of perfection.

source: བསམ་གཏན་མཉམ་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of the sameness of correct conduct: that is the meaning of perfection.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཤེས་པར་མཁས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་དོན་ནི།
en: The fulfillment of the sameness of patience: that is the meaning of perfection.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །བརྩོན་འགྲུས་མཉམ་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of the sameness of diligence: that is the meaning of perfection.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of special conduct: that is the meaning of perfection.

source: ཆོས་ཐམས་ཅད་རབ་ཏུ་ཤེས་པར་བྱ་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Having perfect knowledge of all phenomena: that is the meaning of perfection.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of patience toward the quality of birthlessness: that is the meaning of perfection.

source: ཕྱིར་མི་ལྡོག་པའི་ས་ཡང་དག་པར་ཐོབ་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The attainment of the level of irreversibility: that is the meaning of perfection.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱང་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The purification of a buddha realm: that is the meaning of perfection.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Ripening completely all beings: that is the meaning of perfection.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of the wisdom of buddhahood at a Bodhimaṇḍa: that is the meaning of perfection.

source: བདུད་ཐམས་ཅད་གདུལ་བར་བྱ་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The subjugation of all māras: that is the meaning of perfection.

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་གཉིས་སུ་མེད་པར་སྟོན་ཅིང་སྒྲོལ་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Liberating and manifesting the nonduality of saṃsāra and nirvāṇa: that is the meaning of perfection.

source: ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་འགྲོ་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Reaching the perfection of qualities: that is the meaning of perfection.

source: ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཚར་གཅོད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The eradication of adversaries: that is the meaning of perfection.

source: སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་དོན་ནི།
en: The fulfillment of the ten strengths, the fearlessnesses, and the eighteen unique qualities of a buddha: that is the meaning of perfection.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: The fulfillment of all the qualities of buddhahood: that is the meaning of perfection.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱེད་པའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Complete enlightenment as the highest, most complete enlightenment: that is the meaning of perfection.

source: ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པ་བཅུ་གཉིས་སུ་བསྐོར་བའི་དོན་ནི། ཕ་རོལ་ཏུ་ཕྱིན་པའི་དོན་ནོ། །
en: Turning the wheel of the Dharma in twelve ways: that is the meaning of perfection.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོའི་སྔ་ལྟས་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གཏེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གིས་ཡོངས་སུ་གང་བར་མཐོང་ངོ་། །
en: “Noble one, the omen of the first bodhisattva bhūmi of a bodhisattva mahāsattva is seeing that the trichiliocosm world realm becomes filled with a hundred thousand quintillion treasures.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་གཉིས་པའི་སྔ་ལྟས་ནི། གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལག་མཐིལ་ལྟ་བུར་གྱུར་པ་ལ་རིན་པོ་ཆེ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་ལེགས་པར་བརྒྱན་པར་མཐོང་ངོ་། །
en: “The omen of the second bodhisattva bhūmi of a bodhisattva mahāsattva is seeing that the trichiliocosm world realm becomes like the palm of the hand and is perfectly adorned by many hundred thousand quintillions of jewels.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་གསུམ་པའི་སྔ་ལྟས་ནི། བདག་ཉིད་དཔའ་ཞིང་ལག་ཆ་དང་གོ་ཆ་སྲ་བ་ཐོགས་ནས་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་འདུལ་བར་མཐོང་ངོ་། །
en: “The omen of the third bodhisattva bhūmi of a bodhisattva mahāsattva is seeing oneself as a warrior holding weapons, wearing strong armor, and subjugating one’s foes.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་བཞི་པའི་སྔ་ལྟས་ནི། ཕྱོགས་བཞི་ནས་རླུང་གི་དཀྱིལ་འཁོར་བཞིས་ཐམས་ཅད་དང་ལྡན་པའི་སའི་དཀྱིལ་འཁོར་ཆེན་པོ་ལ་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་མངོན་དུ་འཐོར་བར་མཐོང་ངོ་། །
en: “The omen of the fourth bodhisattva bhūmi of a bodhisattva mahāsattva is seeing four circles of wind from the four directions scattering various flowers over the great circle of the all-possessing earth.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལྔ་པའི་སྔ་ལྟས་ནི། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པའི་བུད་མེད་ཀྱིས་མགོ་ལ་མེ་ཏོག་ཙམ་པ་ཀའི་ཕྲེང་བ་འདོགས་པར་མཐོང་ངོ་། །
en: “The omen of the fifth bodhisattva bhūmi of a bodhisattva mahāsattva is seeing a woman adorned in every kind of jewelry placing a garland of magnolia flowers on one’s head.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་དྲུག་པའི་སྔ་ལྟས་ནི།
en: “The omen of the sixth bodhisattva bhūmi of a bodhisattva mahāsattva is seeing a pool with four stairways, at the bottom of which is gold sand.

source: རྫིང་ཐེམ་སྐས་བཞི་དང་ལྡན་པ་གསེར་གྱི་བྱེ་མ་བདལ་བ་རྙོག་པ་མེད་ཅིང་དང་ལ་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་བ་མེ་ཏོག་ཨུཏྤ་ལ་དང་།
en: The pool is filled with water that is not muddied, but clear, and it possesses the eight good qualities.

source: ཀུ་མུ་ད་དང་། པདྨ་དཀར་པོས་བརྒྱན་པའི་ཆུ་མཐོང་སྟེ། དེ་ལ་བདག་ཉིད་རྩེ་དགའ་ཞིང་ཡོངས་སུ་སྤྱོད་པར་མཐོང་ངོ་། །
en: Its water is adorned with blue lotuses, night lotuses, and white lotuses, and one uses it for one’s own pleasure.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པའི་སྔ་ལྟས་ནི། ཕྱོགས་གཡས་གཡོན་གཉིས་ན། སེམས་ཅན་དམྱལ་བའི་གཡང་ས་མཐོང་སྟེ། དེ་ནས་བདག་ཉིད་མ་རྨས་མ་ཉམས་པར་སླར་ལྡོག་པ་མཐོང་ངོ་། །
en: “The omen of the seventh bodhisattva bhūmi of a bodhisattva mahāsattva is seeing the chasm of the hells to one’s right and left and returning from that unwounded and unharmed.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པའི་སྔ་ལྟས་ནི། ཕྲག་པ་གཉིས་ན་རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེ་རལ་པ་ཅན་ཅོད་པན་ཐོགས་པ། གཅན་གཟན་ཕྲ་མོ་ཐམས་ཅད་སྐྲག་པར་བྱེད་ཅིང་འདུག་པར་མཐོང་ངོ་། །
en: “The omen of the eighth bodhisattva bhūmi of a bodhisattva mahāsattva is seeing that one carries upon both shoulders lions, the kings of beasts, crowned with their manes, terrifying all the smaller beasts.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པའི་སྔ་ལྟས་ནི། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་མཐོང་སྟེ་སྐྱེ་བོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ལ་མགོའི་སྟེང་ན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་གདུགས་དཀར་པོ་འཛིན་པ་མཐོང་ངོ་། །
en: “The omen of the ninth bodhisattva bhūmi of a bodhisattva mahāsattva is seeing oneself as a cakravartin king encircled by many hundred thousand quintillions of people, as one is looking straight ahead with a white parasol adorned with various jewels held above one’s head.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པའི་སྔ་ལྟས་ནི། དེ་བཞིན་གཤེགས་པའི་སྐུ་མཐོང་སྟེ། ཁ་དོག་གསེར་ལྟ་བུའི་འོད་འདོམ་གང་བ་ཚངས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་པར་མཐོང་སྟེ།
en: “The omen of the tenth bodhisattva bhūmi of a bodhisattva mahāsattva is seeing the body of a tathāgata who is looking straight ahead and teaching the Dharma, and who is the color of gold with a fathom-wide aura, encircled by many hundred thousand quintillions of Brahmās.
